import { Service } from "@/types";

export const SERVICES: Service[] = [
  { id: "Маникюр", name: "Маникюр", master: "Лиза" },
  { id: "Перманент", name: "Перманентный макияж", master: "Женя" },
  { id: "Ламинирование", name: "Ламинирование ресниц", master: "Женя" },
];

export const TIME_SLOTS = [
  "09:00", "10:00", "11:00", "12:00", "13:00",
  "14:00", "15:00", "16:00", "17:00", "18:00"
];

export const CONFLICT_MATRIX: Record<string, string[]> = {
  "Маникюр": ["Перманент"],
  "Перманент": ["Маникюр", "Ламинирование", "Перманент"],
  "Ламинирование": ["Перманент", "Ламинирование"],
};
